package com.atguigu.chapter12

/**
 * 第12章 总结
 *
 * 12.1 开发环境
 *  要求掌握必要的Scala开发环境搭建技能。
 *
 * 12.2 变量和数据类型
 *  掌握var和val的区别
 *  掌握数值类型（Byte、Short、Int、Long、Float、Double、Char）之间的转换关系

 * 12.3 流程控制
 * 掌握if-else、for、while等必要的流程控制结构，掌握如何实现break、continue的功能。
 *
 * 12.4 函数式编程
 * 掌握高阶函数、匿名函数、函数柯里化、函数参数以及函数至简原则。
 *
 * 12.5 面向对象
 * 掌握Scala与Java继承方面的区别、单例对象（伴生对象）、特质的用法及功能。
 *
 * 12.6 集合
 * 掌握常用集合的使用、集合常用的计算函数。
 *
 * 12.7 模式匹配
 * 掌握模式匹配的用法
 *
 * 12.8 异常
 * 掌握异常常用操作即可
 *
 * 12.9 隐式转换
 * 掌握隐式方法、隐式参数、隐式类，以及隐式解析机制
 *
 * 12.10 泛型
 * 掌握泛型语法
 *
 */
object Conclusion {

}
